In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
%matplotlib inline

In [2]:
df = pd.read_csv('C:/git/Machine-Learning-A-Z-Udemy/data_files/Data.csv')
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [3]:
from sklearn.impute import SimpleImputer
#Trabalhando com Pandas
colunas = ['Age', 'Salary'] #Parte que normalmente precisa alterar
imputer = SimpleImputer(missing_values=np.nan,strategy = 'mean')
imputer.fit(df[colunas])
df[colunas] = imputer.transform(df[colunas])
df

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

In [4]:
import category_encoders as ce
ohe = ce.OneHotEncoder(handle_unknown='ignore', use_cat_names=True)
df_ohe = ohe.fit_transform(df)
df_ohe.head()

,Country_France,Country_Spain,Country_Germany,Age,Salary,Purchased_No,Purchased_Yes
0,1,0,0,44.0,72000.000000,1,0
1,0,1,0,27.0,48000.000000,0,1
2,0,0,1,30.0,54000.000000,1,0
3,0,1,0,38.0,61000.000000,1,0
4,0,0,1,40.0,63777.777778,0,1

In [15]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [16]:
df = pd.read_csv('C:/git/Machine-Learning-A-Z-Udemy/data_files/Salary_Data.csv')

In [20]:
df.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [18]:
from sklearn.model_selection import train_test_split

In [31]:
X = pd.DataFrame(df['YearsExperience'])
y = pd.DataFrame(df['Salary'])

In [32]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=1/3, random_state=0)

In [33]:
from sklearn.linear_model import LinearRegression

In [34]:
lm = LinearRegression()

In [35]:
lm.fit(X_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [36]:
prediction = lm.predict(X_test)

In [37]:
prediction

array([[ 40835.10590871],
       [123079.39940819],
       [ 65134.55626083],
       [ 63265.36777221],
       [115602.64545369],
       [108125.8914992 ],
       [116537.23969801],
       [ 64199.96201652],
       [ 76349.68719258],
       [100649.1375447 ]])